app/controllers/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "answers" ("question_id", "email", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question_id", 3], ["email", "booth.brandon4@gmail.com"], ["body", "a"], ["created_at", "2017-05-29 20:51:51.652991"], ["updated_at", "2017-05-29 20:51:51.652991"]]
---
  def create
    question = Question.find(params[:answer][:question_id])
    answer = question.answers.create(answer_params)